<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------

return [
    'type' => 'complex',
    'default' => [
        'type' => 'redis',
        'host' => env('REDIS_CACHE_HOST'),
        'port' => env('REDIS_CACHE_PORT'),
        'password' => env('REDIS_CACHE_PASSWORD'),
        'select' => env('REDIS_CACHE_DB'),
        'timeout' => 3600,
        // 全局缓存有效期（0为永久有效）
        'expire' => 3600,
        // 缓存前缀
        'prefix' => '',
    ],
    'file' => [
        'type' => 'file',
        'path' => '../runtime/cache/',
        // 缓存前缀
        'prefix' => '',
        // 缓存有效期 0表示永久缓存
        'expire' => 0,
    ],
];
